app/controllers/registrations_controller.rb

SELECT "registrations".* FROM "registrations"
---
  def index
    @registrations = Registration.all

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" IS NULL LIMIT 1
---
  def new
    @registration = Registration.new
    @course = Course.find_by id: params["course_id"]

INSERT INTO "registrations" ("company", "course_id", "created_at", "email", "full_name", "notification_params", "telephone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @registration = Registration.new(registration_params)
    if @registration.save

SELECT  "registrations".* FROM "registrations"  WHERE "registrations"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "registrations" SET "notification_params" = ?, "purchased_at" = ?, "status" = ?, "transaction_id" = ?, "updated_at" = ? WHERE "registrations"."id" = 2
---
  def hook
    params.permit! # Permit all Paypal input params
    status = params[:payment_status]
    if status == "Completed"
      @registration = Registration.find params[:invoice]
      @registration.update_attributes notification_params: params, status: status, transaction_id: params[:txn_id], purchased_at: Time.now

SELECT  "registrations".* FROM "registrations"  WHERE "registrations"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_registration
      @registration = Registration.find(params[:id])